constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2   0   0)
    (10   0   0)
    (-2   3   0)
    (10   3   0)
    (-2   0   0.1)
    (10   0   0.1)
    (-2   3   0.1)
    (10   3   0.1)
);

blocks
(
    hex (1 3 2 0 5 7 6 4) (60 240 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    stationaryWalls
    {
        type wall;
        faces
        (
            (0 1 5 4) // bottom
            (1 3 7 5) // right
            (0 4 6 2) // left
        );
    }
    frontBack
    {
        type symmetryPlane;
        faces
        (
            (6 4 5 7) // front
            (0 2 3 1) // back
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (2 6 7 3) // top
        );
    }
    floatingObject
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
